// 2290번_LCD Test
#include <iostream>
#include <string>
using namespace std;
int s, digit[11][5][3] = { // s=1 기준 각 숫자의 모양 (가로 3, 세로 5)
    {{0,1,0}, {1,0,1}, {0,0,0}, {1,0,1}, {0,1,0}}, // 0
    {{0,0,0}, {0,0,1}, {0,0,0}, {0,0,1}, {0,0,0}}, // 1
    {{0,1,0}, {0,0,1}, {0,1,0}, {1,0,0}, {0,1,0}}, // 2
    {{0,1,0}, {0,0,1}, {0,1,0}, {0,0,1}, {0,1,0}}, // 3
    {{0,0,0}, {1,0,1}, {0,1,0}, {0,0,1}, {0,0,0}}, // 4
    {{0,1,0}, {1,0,0}, {0,1,0}, {0,0,1}, {0,1,0}}, // 5
    {{0,1,0}, {1,0,0}, {0,1,0}, {1,0,1}, {0,1,0}}, // 6
    {{0,1,0}, {0,0,1}, {0,0,0}, {0,0,1}, {0,0,0}}, // 7
    {{0,1,0}, {1,0,1}, {0,1,0}, {1,0,1}, {0,1,0}}, // 8
    {{0,1,0}, {1,0,1}, {0,1,0}, {0,0,1}, {0,1,0}}  // 9
};
string n;
int main(){
    cin >> s >> n;
    // 기준 숫자 모양에서 실제 표시를 하는 부분을 s회 반복하며 입력 숫자들을 한 행씩 출력
    // 홀수행은 가운데 열 (idx:1), 짝수행은 처음과 마지막 열 (idx:0, 2)이 모양을 표시하는 부분
    for(int i=0; i<5; ++i){
        if(i%2 == 0){ // 홀수행 '-' 출력
            for(int j=0; j<n.length(); ++j){
                int cur = n[j]-'0';
                cout << ' '; // 홀수행의 숫자들은 첫 열, 마지막 열이 항상 공백
                for(int k=0; k<s; ++k) cout << (digit[cur][i][1]==1 ? '-' : ' ');
                cout << "  "; // 각 숫자 사이에 공백 추가
            }
            cout << '\n'; // 다음 행 확인
        }
        else{ // 짝수 행 '|' 출력
            for(int x=0; x<s; ++x){ // 짝수행의 값을 s회 반복 출력
                for(int j=0; j<n.length(); ++j){
                    int cur = n[j]-'0';    
                    cout << (digit[cur][i][0]==1 ? '|' : ' ');
                    for(int k=0; k<s; ++k) cout << ' '; // 짝수행 가운데 부분의 열은 항상 공백 
                    cout << (digit[cur][i][2]==1 ? '|' : ' ');
                    cout << ' ';
                }
                cout << '\n';
            }
        }
    }
    return 0;
}